# Content

### 00. Import Libraries
### 01. Import Data Sets
### 02. Natural Disasters Data Wrangling 
### 03.Temperature Changes Data Wrangling 
### 04. Migration Data Wrangling
### 05. Population Data Wrangling
### 06. CO2 Emissions Data Wrangling
### 07. Energy Consumption Data Wrangling
### 08. Export Clean Data

## 00. Import Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import pycountry
import os

## 01. Import Data Sets

In [2]:
# Create folder path
path = r"C:\Users\Juliana\Documents\DATA ANALYTICS COURSE\IMMERSION\6"

In [3]:
# Import natural disasters data
nat_disasters= pd.read_csv(os.path.join(path,'02 Data','Original Data','1900_2021_DISASTERS.csv'))

In [4]:
# Import temperature changes data
temp_change = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'Environment_Temperature_change.csv'), encoding='ISO-8859-1')

In [5]:
# Import migration data
net_migration = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'net_migration_by_country.csv'))

In [6]:
# Import population data
population = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'migration_population.csv'), delimiter=';')

In [7]:
# Import CO2 emissions data
co2_emissions = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'co2_emissions.csv'))

In [8]:
# Import energy consumtion data
energy_consumption = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'primary-energy-cons (2).csv'))

## 02. Natural Disasters Data Wrangling

In [9]:
# Natural Disasters Data Exploration 
nat_disasters.shape

(16126, 45)

In [10]:
nat_disasters.head()

,Year,Seq,Glide,Disaster Group,Disaster Subgroup,Disaster Type,Disaster Subtype,Disaster Subsubtype,Event Name,Country,...,No Affected,No Homeless,Total Affected,Insured Damages ('000 US$),Total Damages ('000 US$),CPI,Adm Level,Admin1 Code,Admin2 Code,Geo Locations
0,1900,9002,NaN,Natural,Climatological,Drought,Drought,NaN,NaN,Cabo Verde,...,NaN,NaN,NaN,NaN,NaN,3.221647,NaN,NaN,NaN,NaN
1,1900,9001,NaN,Natural,Climatological,Drought,Drought,NaN,NaN,India,...,NaN,NaN,NaN,NaN,NaN,3.221647,NaN,NaN,NaN,NaN
2,1902,12,NaN,Natural,Geophysical,Earthquake,Ground movement,NaN,NaN,Guatemala,...,NaN,NaN,NaN,NaN,25000.0,3.350513,NaN,NaN,NaN,NaN
3,1902,3,NaN,Natural,Geophysical,Volcanic activity,Ash fall,NaN,Santa Maria,Guatemala,...,NaN,NaN,NaN,NaN,NaN,3.350513,NaN,NaN,NaN,NaN
4,1902,10,NaN,Natural,Geophysical,Volcanic activity,Ash fall,NaN,Santa Maria,Guatemala,...,NaN,NaN,NaN,NaN,NaN,3.350513,NaN,NaN,NaN,NaN

In [11]:
nat_disasters.columns

Index(['Year', 'Seq', 'Glide', 'Disaster Group', 'Disaster Subgroup',
       'Disaster Type', 'Disaster Subtype', 'Disaster Subsubtype',
       'Event Name', 'Country', 'ISO', 'Region', 'Continent', 'Location',
       'Origin', 'Associated Dis', 'Associated Dis2', 'OFDA Response',
       'Appeal', 'Declaration', 'Aid Contribution', 'Dis Mag Value',
       'Dis Mag Scale', 'Latitude', 'Longitude', 'Local Time', 'River Basin',
       'Start Year', 'Start Month', 'Start Day', 'End Year', 'End Month',
       'End Day', 'Total Deaths', 'No Injured', 'No Affected', 'No Homeless',
       'Total Affected', 'Insured Damages ('000 US$)',
       'Total Damages ('000 US$)', 'CPI', 'Adm Level', 'Admin1 Code',
       'Admin2 Code', 'Geo Locations'],
      dtype='object')

In [12]:
# Remove unnecessary or irrelevant columns
nat_disasters=nat_disasters.drop(columns = ['Seq', 'Disaster Group','Glide','Associated Dis', 'Associated Dis2', 'OFDA Response',
       'Appeal', 'Declaration', 'Aid Contribution', 'River Basin','No Homeless', "Insured Damages ('000 US$)","Total Damages ('000 US$)", 'CPI', 'Adm Level', 'Admin1 Code',
       'Admin2 Code', 'Geo Locations', 'Start Year', 'Start Month', 'Start Day', 'End Year', 'End Month','End Day'])

In [13]:
# Find missing values in nat_disasters
nat_disasters.isnull().sum()

Year                       0
Disaster Subgroup          0
Disaster Type              0
Disaster Subtype        3110
Disaster Subsubtype    15049
Event Name             12265
Country                    0
ISO                        0
Region                     0
Continent                  0
Location                1792
Origin                 12332
Dis Mag Value          11180
Dis Mag Scale           1190
Latitude               13397
Longitude              13394
Local Time             15023
Total Deaths            4713
No Injured             12231
No Affected             6906
Total Affected          4509
dtype: int64

In [14]:
# Remove Columns with Missing Values Exceeding 5%
nat_disasters=nat_disasters.drop(columns = ['Disaster Subsubtype','Event Name','Location','Origin','Dis Mag Value','Dis Mag Scale','Latitude','Longitude','Local Time','No Injured','Total Affected'])

In [15]:
# Format column names
nat_disasters.rename(columns={'Disaster Subgroup' : 'Event_type',
                       'Disaster Type' : 'Event_Category',
                        'ISO' : 'Country_Code',
                        'Start Year': 'Start_Year',
                        'Start Month': 'Start_Month',
                        'Total Deaths':'Total_deaths',
                         'No Affected':'No_Affected',
                        'End Year':'End_Year',
                        'End Month':'End_Month'}, inplace = True)

In [16]:
# Generate descriptive statistics for nat_disasters"
nat_disasters.describe()

               Year  Total_deaths   No_Affected
count  16126.000000  1.141300e+04  9.220000e+03
mean    1996.764790  2.842866e+03  8.823612e+05
std       20.159065  6.860595e+04  8.573913e+06
min     1900.000000  1.000000e+00  1.000000e+00
25%     1989.000000  6.000000e+00  1.244750e+03
50%     2001.000000  2.000000e+01  1.000000e+04
75%     2011.000000  6.300000e+01  9.182300e+04
max     2021.000000  3.700000e+06  3.300000e+08

In [17]:
# Identify duplicates in nat_disasters
nat_disasters_dups= nat_disasters[nat_disasters.duplicated]
#Print the duplicates
nat_disasters_dups

,Year,Event_type,Event_Category,Disaster Subtype,Country,Country_Code,Region,Continent,Total_deaths,No_Affected
508,1969,Climatological,Wildfire,"Land fire (Brush, Bush, Pasture)",Hong Kong,HKG,Eastern Asia,Asia,NaN,NaN
550,1970,Climatological,Wildfire,"Land fire (Brush, Bush, Pasture)",Hong Kong,HKG,Eastern Asia,Asia,NaN,NaN
579,1971,Climatological,Wildfire,"Land fire (Brush, Bush, Pasture)",Hong Kong,HKG,Eastern Asia,Asia,NaN,NaN
596,1972,Climatological,Wildfire,"Land fire (Brush, Bush, Pasture)",Hong Kong,HKG,Eastern Asia,Asia,NaN,NaN
597,1972,Climatological,Wildfire,"Land fire (Brush, Bush, Pasture)",Hong Kong,HKG,Eastern Asia,Asia,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
16044,2020,Meteorological,Storm,Convective storm,United States of America (the),USA,Northern America,Americas,NaN,NaN
16046,2020,Meteorological,Storm,Convective storm,United States of America (the),USA,Northern America,Americas,NaN,NaN
16075,2021,Meteorological,Storm,Convective storm,United States of America (the),USA,Northern America,Americas,3.0,NaN
16085,2021,Meteorological,Storm,Convective storm,United States of America (the),USA,Northern America,Americas,3.0,NaN
16107,2021,Climatological,Wildfire,Forest fire,United States of America (the),USA,Northern America,Americas,NaN,NaN

In [18]:
# Addressing duplicates
nat_disasters.shape

(16126, 10)

In [19]:
#Deleting duplicates
nat_disasters=nat_disasters.drop_duplicates()

In [20]:
#Reviewing the updated dataFrame
nat_disasters.shape

(15804, 10)

In [21]:
#Inspect for mixed data types
for col in nat_disasters.columns.tolist():
  weird = (nat_disasters[[col]].applymap(type) != nat_disasters[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (nat_disasters[weird]) > 0:
    print (col)

Disaster Subtype

In [22]:
#Convert 'Disaster Subtype' to string 
nat_disasters.loc[:, 'Disaster Subtype'] = nat_disasters['Disaster Subtype'].astype(str)

In [23]:
# Filtering nat_disasters to include only values from 1965 to maintain consistency with other datasets
nat_disasters_filtered = nat_disasters[nat_disasters['Year'] >= 1965]

In [24]:
# Validate filtered data
nat_disasters_filtered.describe()

               Year  Total_deaths   No_Affected
count  14724.000000  1.042300e+04  9.061000e+03
mean    2000.788509  5.100138e+02  8.867238e+05
std       13.567642  1.603767e+04  8.642699e+06
min     1965.000000  1.000000e+00  1.000000e+00
25%     1992.000000  5.000000e+00  1.200000e+03
50%     2003.000000  1.700000e+01  1.000000e+04
75%     2011.000000  5.200000e+01  9.000000e+04
max     2021.000000  1.500000e+06  3.300000e+08

In [25]:
# Check for missing values
nat_disasters_filtered.isnull().sum()

Year                   0
Event_type             0
Event_Category         0
Disaster Subtype       0
Country                0
Country_Code           0
Region                 0
Continent              0
Total_deaths        4301
No_Affected         5663
dtype: int64

The columns 'Total_deaths' and 'No_Affected' have been kept due to their potential relevance for future analysis, even if incomplete.

## 03.Temperature Changes Data Wrangling

In [26]:
# Temperature changes data exploration 
temp_change.shape

(554098, 12)

In [27]:
temp_change.head()

,Area Code,Area Code (M49),Area,Months Code,Months,Element Code,Element,Year Code,Year,Unit,Value,Flag
0,2,'004,Afghanistan,7001,January,7271,Temperature change,1961,1961,Â°C,0.756,E
1,2,'004,Afghanistan,7001,January,7271,Temperature change,1962,1962,Â°C,0.030,E
2,2,'004,Afghanistan,7001,January,7271,Temperature change,1963,1963,Â°C,2.716,E
3,2,'004,Afghanistan,7001,January,7271,Temperature change,1964,1964,Â°C,-5.260,E
4,2,'004,Afghanistan,7001,January,7271,Temperature change,1965,1965,Â°C,1.834,E

In [28]:
# Remove unnecessary or irrelevant columns
temp_change=temp_change.drop(columns = ['Area Code','Area Code (M49)', 'Months Code','Element Code',  'Year Code','Unit', 'Flag'])

In [29]:
# Create a new column containing ISO codes for each country to ensure consistency with other datasets.
# Function to get ISO country code
def get_country_code(country_name):
    try:
        country_obj = pycountry.countries.get(name=country_name)
        return country_obj.alpha_3
    except AttributeError:
        return None

# Add 'Country_Code' column to the DataFrame
temp_change['Country_Code'] = temp_change['Area'].apply(get_country_code)

In [30]:
# Print the updated DataFrame
temp_change.head()

          Area   Months             Element  Year  Value Country_Code
0  Afghanistan  January  Temperature change  1961  0.756          AFG
1  Afghanistan  January  Temperature change  1962  0.030          AFG
2  Afghanistan  January  Temperature change  1963  2.716          AFG
3  Afghanistan  January  Temperature change  1964 -5.260          AFG
4  Afghanistan  January  Temperature change  1965  1.834          AFG

In [31]:
# Format column names
temp_change.rename(columns={'Area':'Country',
                            'Value' : 'Temperature_Change'}, inplace = True)

In [32]:
# Find missing values in temp_change
temp_change.isnull().sum()

Country                    0
Months                     0
Element                    0
Year                       0
Temperature_Change     37659
Country_Code          139570
dtype: int64

In [33]:
# Create a df with the missing country codes to investigate further
missing_cc = temp_change[pd.isnull(temp_change['Country_Code'])]

#Export missing_cc
missing_cc.to_csv(os.path.join(path,'02 Data','Cleaned Data', 'missing_cc.csv'))

The missing values in the 'Country_Code' column refer to country groups or continents such as Africa, Americas, Asia, and specific entities like Hong Kong SAR. These groups include various countries, and there are no specific codes because of their diverse nature. Also, some countries in these groups do not exist anymore.

In [34]:
# Create a subset where 'Country_Code' is missing
subset_missing_country_codes = temp_change[temp_change['Country_Code'].isnull()]

# Manually add missing 'Country_Code' values based on the mapping dictionary
country_code_mapping = {
    'Bolivia (Plurinational State of)': 'BOL',
    'British Virgin Islands': 'VGB',
    'China, mainland': 'CHN',
    'Czechoslovakia': 'CSK',
    'Democratic People\'s Republic of Korea': 'PRK',
    'Democratic Republic of the Congo': 'COD',
    'Ethiopia PDR': 'ETH',
    'Iran (Islamic Republic of)': 'IRN',
    'Micronesia (Federated States of)': 'FSM',
    'Netherlands Antilles (former)': 'ANT',
    'Palestine': 'PSE',
    'Polynesia': 'PYF',
    'Republic of Korea': 'KOR',
    'Republic of Moldova': 'MDA',
    'Serbia and Montenegro': 'SCG',
    'Sudan (former)': 'SDN',
    'TÃ¼rkiye': 'TUR',
    'United Kingdom of Great Britain and Northern Ireland': 'GBR',
    'United Republic of Tanzania': 'TZA',
    'United States of America': 'USA',
    'United States Virgin Islands': 'VIR',
    'USSR': 'RUS', 
    'Venezuela (Bolivarian Republic of)': 'VEN',
    'Wallis and Futuna Islands': 'WLF',
    'Yugoslav SFR': 'YUG'}

subset_missing_country_codes['Country_Code'] = subset_missing_country_codes['Country'].map(country_code_mapping)

# Combine the original DataFrame and the subset with manually filled 'Country_Code' values
temp_change['Country_Code'].fillna(subset_missing_country_codes['Country_Code'], inplace=True)

C:\Users\Juliana\AppData\Local\Temp\ipykernel_22600\4197805029.py:32: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset_missing_country_codes['Country_Code'] = subset_missing_country_codes['Country'].map(country_code_mapping)

In [35]:
temp_change.isnull().sum()

Country                   0
Months                    0
Element                   0
Year                      0
Temperature_Change    37659
Country_Code          95098
dtype: int64

In [36]:
# Drop rows with missing values in the 'Country_Code' column
temp_change_cleaned = temp_change.dropna(subset=['Country_Code'])

In [37]:
temp_change_cleaned.shape

(459000, 6)

In [38]:
#Verify data types
temp_change_cleaned.dtypes

Country                object
Months                 object
Element                object
Year                    int64
Temperature_Change    float64
Country_Code           object
dtype: object

In [39]:
#Inspect for mixed data types
for col in temp_change_cleaned.columns.tolist():
  weird = (temp_change_cleaned[[col]].applymap(type) != temp_change_cleaned[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (temp_change_cleaned[weird]) > 0:
    print (col)

In [40]:
# Generate descriptive statistics for temp_change_cleaned
temp_change_cleaned.describe()

                Year  Temperature_Change
count  459000.000000       425159.000000
mean     1992.436889            0.594697
std        17.895641            0.806221
min      1961.000000           -9.191000
25%      1977.000000            0.266000
50%      1993.000000            0.494000
75%      2008.000000            0.933000
max      2022.000000            9.724000

In [41]:
# Review the 'Element' column values for relevance
temp_change_cleaned['Element'].value_counts()

Temperature change    229500
Standard Deviation    229500
Name: Element, dtype: int64

In [42]:
# Filter data to display only 'Temperature Change' in the 'Element' column
temp_change_cleaned_1 = temp_change_cleaned[temp_change_cleaned['Element'] == 'Temperature change']

In [43]:
# Confirming filtered data
temp_change_cleaned_1['Element'].value_counts()

Temperature change    229500
Name: Element, dtype: int64

In [44]:
# Remove Column 'Element' since it is now irrelevant
temp_change_cleaned_1=temp_change_cleaned_1.drop(columns = ['Element'])

In [45]:
# Review the 'Months' column values for relevance
temp_change_cleaned_1['Months'].value_counts()

January                13500
October                13500
SepÂ–OctÂ–Nov            13500
JunÂ–JulÂ–Aug            13500
MarÂ–AprÂ–May            13500
DecÂ–JanÂ–Feb            13500
December               13500
November               13500
September              13500
February               13500
August                 13500
July                   13500
June                   13500
May                    13500
April                  13500
March                  13500
Meteorological year    13500
Name: Months, dtype: int64

In [46]:
# Filter data to display only the 12 months in the 'Months' column
temp_change_cleaned_2 = temp_change_cleaned_1[temp_change_cleaned_1['Months'].isin(['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December'])].copy()

# Define a dictionary to map month names to numbers for consistency
month_dict = {'January': 1, 'February': 2, 'March': 3, 'April': 4, 'May': 5, 'June': 6, 'July': 7, 'August': 8, 'September': 9, 'October': 10, 'November': 11, 'December': 12}

# Map the month names to numbers using the dictionary and create a new column 'Month'
temp_change_cleaned_2['Month'] = temp_change_cleaned_1['Months'].map(month_dict)

In [47]:
#Verify month format change
temp_change_cleaned_2['Month'].value_counts()

1.0     13500
2.0     13500
3.0     13500
4.0     13500
5.0     13500
6.0     13500
7.0     13500
8.0     13500
9.0     13500
10.0    13500
11.0    13500
12.0    13500
Name: Month, dtype: int64

In [48]:
# Filter temp_change_filtered2 to include only values from 1965 to maintain consistency with other datasets
temp_change_cleaned_3 = temp_change_cleaned_2[(temp_change_cleaned_2['Year'] >= 1965)]

In [49]:
# Validate filtered data
temp_change_cleaned_3.describe()

                Year  Temperature_Change          Month
count  152160.000000       147142.000000  152160.000000
mean     1994.372871            0.561920       6.500000
std        16.708661            1.100637       3.452064
min      1965.000000           -9.191000       1.000000
25%      1980.000000           -0.042000       3.750000
50%      1995.000000            0.496000       6.500000
75%      2009.000000            1.099000       9.250000
max      2022.000000            9.724000      12.000000

In [50]:
temp_change_cleaned_3.shape

(152160, 6)

In [51]:
# Find missing values in temp_change_cleaned_3
temp_change_cleaned_3.isnull().sum()

Country                  0
Months                   0
Year                     0
Temperature_Change    5018
Country_Code             0
Month                    0
dtype: int64

In [52]:
# Find duplicates for temp_change_cleaned_3
temp_change_dups= temp_change_cleaned_3[temp_change_cleaned_3.duplicated]
#Print the duplicates
temp_change_dups

Empty DataFrame
Columns: [Country, Months, Year, Temperature_Change, Country_Code, Month]
Index: []

## 04. Migration Data Wrangling

In [53]:
# Migration data exploration 
net_migration.shape

(16430, 4)

In [54]:
net_migration.head()

  country_code country_name  year  value
0          ABW        Aruba  1960    0.0
1          ABW        Aruba  1961 -569.0
2          ABW        Aruba  1962 -609.0
3          ABW        Aruba  1963 -646.0
4          ABW        Aruba  1964 -684.0

In [55]:
# Format column names
net_migration.rename(columns={'country_code':'Country_Code',
                             'country_name':'Country',
                              'year':'Year',
                              'value': 'Net_Migration'}, inplace = True)

In [56]:
#Verify data types
net_migration.dtypes

Country_Code      object
Country           object
Year               int64
Net_Migration    float64
dtype: object

In [57]:
#Inspect for mixed data types
for col in net_migration.columns.tolist():
  weird = (net_migration[[col]].applymap(type) != net_migration[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (net_migration[weird]) > 0:
    print (col)

In [58]:
# Generate descriptive statistics for net_migration
net_migration.describe()

               Year  Net_Migration
count  16430.000000   1.643000e+04
mean    1990.500000  -5.161849e+04
std       17.896075   5.327357e+05
min     1960.000000  -5.955151e+06
25%     1975.000000  -2.665100e+04
50%     1990.500000  -1.075000e+03
75%     2006.000000   5.400000e+03
max     2021.000000   5.838720e+06

In [59]:
# Filter net_migration to include only values from 1965 to maintain consistency with other datasets
net_migration_filtered = net_migration[(net_migration['Year'] >= 1965)]

In [60]:
# Validate filtered data
net_migration_filtered.describe()

               Year  Net_Migration
count  15105.000000   1.510500e+04
mean    1993.000000  -5.466608e+04
std       16.452495   5.539480e+05
min     1965.000000  -5.955151e+06
25%     1979.000000  -2.746800e+04
50%     1993.000000  -1.206000e+03
75%     2007.000000   5.901000e+03
max     2021.000000   5.838720e+06

In [61]:
# Find missing values in net_migration_filtered
net_migration_filtered.isnull().sum()

Country_Code     0
Country          0
Year             0
Net_Migration    0
dtype: int64

In [62]:
# Find duplicates for net_migration
net_migration_dups= net_migration_filtered[net_migration_filtered.duplicated]
#Print the duplicates
net_migration_dups

Empty DataFrame
Columns: [Country_Code, Country, Year, Net_Migration]
Index: []

## 05. Population Data Wrangling

In [63]:
#Population data exploration
population.shape

(15576, 15)

In [64]:
population.head()

,country,year,population,pop_density,net_migration,migration_perc,iso3c,iso2c,region,adminregion,incomeLevel,lendingType,capitalCity,longitude,latitude
0,Arab World,1960,9.219775e+07,NaN,NaN,NaN,ARB,1A,Aggregates,NaN,Aggregates,Aggregates,NaN,NaN,NaN
1,Caribbean small states,1960,4.194710e+06,NaN,NaN,NaN,CSS,S3,Aggregates,NaN,Aggregates,Aggregates,NaN,NaN,NaN
2,Central Europe and the Baltics,1960,9.140176e+07,NaN,NaN,NaN,CEB,B8,Aggregates,NaN,Aggregates,Aggregates,NaN,NaN,NaN
3,Early-demographic dividend,1960,9.800853e+08,NaN,NaN,NaN,EAR,V2,Aggregates,NaN,Aggregates,Aggregates,NaN,NaN,NaN
4,East Asia & Pacific,1960,1.040958e+09,NaN,NaN,NaN,EAS,Z4,Aggregates,NaN,Aggregates,Aggregates,NaN,NaN,NaN

In [65]:
# Remove unnecessary or irrelevant columns
population=population.drop(columns = ['pop_density','net_migration','migration_perc', 'iso2c', 'region', 'adminregion','incomeLevel', 'lendingType', 'capitalCity', 'longitude', 'latitude'])

In [66]:
# Format column names
population.rename(columns={'country':'Country',
                           'year':'Year',
                           'population': 'Population',
                           'iso3c': 'Country_Code'}, inplace = True)

In [67]:
#Verify data types
population.dtypes

Country          object
Year              int64
Population      float64
Country_Code     object
dtype: object

In [68]:
#Inspect for mixed data types
for col in population.columns.tolist():
  weird = (population[[col]].applymap(type) != population[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (population[weird]) > 0:
    print (col)

Country_Code

In [69]:
#Convert 'Country_Code Subtype' to string 
population.loc[:, 'Country_Code'] = population['Country_Code'].astype(str)

In [70]:
# Generate descriptive statistics for population
population.describe()

               Year    Population
count  15576.000000  1.540900e+04
mean    1989.000000  2.078865e+08
std       17.029933  6.867796e+08
min     1960.000000  3.893000e+03
25%     1974.000000  9.268410e+05
50%     1989.000000  6.418773e+06
75%     2004.000000  4.244904e+07
max     2018.000000  7.594270e+09

In [71]:
# Filter population to include only values from 1965 to maintain consistency with other datasets
population_filtered = population[(population['Year'] >= 1965)]

In [72]:
# Validate filtered data
population_filtered.describe()

               Year    Population
count  14256.000000  1.410900e+04
mean    1991.500000  2.157830e+08
std       15.586331  7.076157e+08
min     1965.000000  4.468000e+03
25%     1978.000000  9.975220e+05
50%     1991.500000  6.736748e+06
75%     2005.000000  4.440590e+07
max     2018.000000  7.594270e+09

In [73]:
# Finding missing values in population_filtered
population_filtered.isnull().sum()

Country           0
Year              0
Population      147
Country_Code      0
dtype: int64

In [74]:
# Find duplicates for population_filtered
population_dups= population_filtered[population_filtered.duplicated]
#Print the duplicates
population_dups

Empty DataFrame
Columns: [Country, Year, Population, Country_Code]
Index: []

In [75]:
population_filtered.shape

(14256, 4)

## 06. CO2 Emissions Data Wrangling

In [76]:
# CO2 Emissions data exploration 
co2_emissions.shape

(13953, 4)

In [77]:
co2_emissions.head()

  country_code country_name  year      value
0          ABW        Aruba  1960  11092.675
1          ABW        Aruba  1961  11576.719
2          ABW        Aruba  1962  12713.489
3          ABW        Aruba  1963  12178.107
4          ABW        Aruba  1964  11840.743

In [78]:
# Format column names
co2_emissions.rename(columns={'country_code':'Country_Code', 
                              'country_name':'Country',
                              'year':'Year',
                              'value':'Carbon_Emissions'}, inplace = True)

In [79]:
#Verify data types
co2_emissions.dtypes

Country_Code         object
Country              object
Year                  int64
Carbon_Emissions    float64
dtype: object

In [80]:
#Inspect for mixed data types
for col in co2_emissions.columns.tolist():
  weird = (co2_emissions[[col]].applymap(type) != co2_emissions[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (co2_emissions[weird]) > 0:
    print (col)

In [81]:
# Generate descriptive statistics for co2_emissions
co2_emissions.describe()

               Year  Carbon_Emissions
count  13953.000000      1.395300e+04
mean    1990.732316      8.254983e+05
std       17.187585      2.788923e+06
min     1960.000000     -8.067400e+01
25%     1976.000000      1.100000e+03
50%     1992.000000      1.390000e+04
75%     2006.000000      1.642779e+05
max     2019.000000      3.434401e+07

There is a negative value that does not make sense

In [82]:
# Count the number of negative values in the 'Carbon_Emissions' column
co2_emissions[co2_emissions['Carbon_Emissions'] < 0]['Carbon_Emissions'].count()

1

In [83]:
# Find the row that constains the negative value
co2_emissions.loc[(co2_emissions['Carbon_Emissions'] == -80.674)]

      Country_Code  Country  Year  Carbon_Emissions
11002          SEN  Senegal  1968           -80.674

The negative value is replaced with the average of the preceding and succeeding year's values.

In [84]:
# Replace negative values with the average of previous and next year's values
for index, row in co2_emissions.iterrows():
    if row['Carbon_Emissions'] < 0:
        # Find the average of previous and next year's values for the same country
        previous_year_value = co2_emissions.loc[(co2_emissions['Country'] == row['Country']) & (co2_emissions['Year'] == row['Year'] - 1), 'Carbon_Emissions'].mean()
        next_year_value = co2_emissions.loc[(co2_emissions['Country'] == row['Country']) & (co2_emissions['Year'] == row['Year'] + 1), 'Carbon_Emissions'].mean()
        
        # Calculate the average of previous and next year's values
        average_value = (previous_year_value + next_year_value) / 2
        
        # Replace the negative value with the calculated average
        co2_emissions.at[index, 'Carbon_Emissions'] = average_value

In [85]:
#Verifying Data Input
co2_emissions.loc[(co2_emissions['Country'] == 'Senegal') & (co2_emissions['Year'] == 1968)]

      Country_Code  Country  Year  Carbon_Emissions
11002          SEN  Senegal  1968          595.8875

In [86]:
# Filter co2_emissions to include only values from 1965 to maintain consistency with other datasets
co2_emissions_filtered = co2_emissions[(co2_emissions['Year'] >= 1965)]

In [87]:
# Validate filtered data
co2_emissions_filtered.describe()

               Year  Carbon_Emissions
count  12920.000000      1.292000e+04
mean    1993.027786      8.603268e+05
std       15.738357      2.873120e+06
min     1965.000000      0.000000e+00
25%     1980.000000      1.271186e+03
50%     1994.000000      1.541987e+04
75%     2007.000000      1.759988e+05
max     2019.000000      3.434401e+07

In [88]:
# Find missing values in co2_emissions_filtered
co2_emissions_filtered.isnull().sum()

Country_Code        0
Country             0
Year                0
Carbon_Emissions    0
dtype: int64

In [89]:
# Find duplicates for co2_emissions_filtered
co2_emissions_dups= co2_emissions_filtered[co2_emissions_filtered.duplicated]
#Print the duplicates
co2_emissions_dups

Empty DataFrame
Columns: [Country_Code, Country, Year, Carbon_Emissions]
Index: []

## 07. Energy Consumption Data Wrangling

In [90]:
# Energy consumption data exploration
energy_consumption.shape

(12588, 4)

In [91]:
energy_consumption.head()

        Entity Code  Year  Primary energy consumption (TWh)
0  Afghanistan  AFG  1980                          7.790772
1  Afghanistan  AFG  1981                          8.777320
2  Afghanistan  AFG  1982                          9.348327
3  Afghanistan  AFG  1983                         11.436162
4  Afghanistan  AFG  1984                         11.489043

In [92]:
# Format column names
energy_consumption.rename(columns={'Entity':'Country', 
                                   'Code': 'Country_Code',
                                   'Primary energy consumption (TWh)':
                                   'Energy_Consumption'}, inplace = True)

In [93]:
#Verify data types
energy_consumption.dtypes

Country                object
Country_Code           object
Year                    int64
Energy_Consumption    float64
dtype: object

In [94]:
#Inspect for mixed data types
for col in energy_consumption.columns.tolist():
  weird = (energy_consumption[[col]].applymap(type) != energy_consumption[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (energy_consumption[weird]) > 0:
    print (col)

Country_Code

In [95]:
# Convert the column Country_Code to object data type
energy_consumption.loc[:, 'Country_Code'] = energy_consumption['Country_Code'].astype(str)

In [96]:
# Generate descriptive statistics for energy_consumption
energy_consumption.describe()

               Year  Energy_Consumption
count  12588.000000        12588.000000
mean    1997.845249         4510.825633
std       14.661257        14901.770356
min     1965.000000            0.000000
25%     1987.000000            9.265126
50%     1999.000000           98.920415
75%     2010.000000         1007.898175
max     2022.000000       167787.670000

In [97]:
# Finding missing values in energy_consumption
energy_consumption.isnull().sum()

Country               0
Country_Code          0
Year                  0
Energy_Consumption    0
dtype: int64

In [98]:
# Find duplicates for energy_consumption_filtered
energy_consumption_dups= energy_consumption[energy_consumption.duplicated]
#Print the duplicates
energy_consumption_dups

Empty DataFrame
Columns: [Country, Country_Code, Year, Energy_Consumption]
Index: []

## 08. Export Clean Data Sets

In [99]:
#Export nat_disasters
nat_disasters_filtered.to_csv(os.path.join(path,'02 Data','Cleaned Data', 'nat_disasters_clean.csv'))

In [100]:
#Export temp_change_filtered3
temp_change_cleaned_3.to_csv(os.path.join(path,'02 Data','Cleaned Data', 'temp_changes_clean.csv'))

In [101]:
#Export net_migration_filtered
net_migration_filtered.to_csv(os.path.join(path,'02 Data','Cleaned Data', 'net_migration_clean.csv'))

In [102]:
#Export population_filtered
population_filtered.to_csv(os.path.join(path,'02 Data','Cleaned Data','population_clean.csv'))

In [103]:
#Export co2_emissions_filtered
co2_emissions_filtered.to_csv(os.path.join(path,'02 Data','Cleaned Data', 'co2_emissions_filtered_clean.csv'))

In [104]:
#Export energy_consumption_filtered
energy_consumption.to_csv(os.path.join(path,'02 Data','Cleaned Data', 'energy_consumption_filtered_clean.csv'))